my_tasks/ncc/app/views/users/index.html.erb

						</li>
						<li><small> <%= pluralize(user.medicines.count, "medicine") if user.medicines %> </small></li>
---
SELECT COUNT(*) FROM "medicines" WHERE "medicines"."user_id" = ?  [["user_id", 1]]