my_tasks/ncc/app/controllers/medicines_controller.rb

	def index
		@medicines = Medicine.all
---
SELECT "medicines".* FROM "medicines"

	def create
		@medicine = Medicine.new(medicine_params)
		@medicine.user = User.first
		if @medicine.save
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "medicines" ("title", "description", "company", "batch_number", "manufacturing_date", "expiry_date", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "Allegra"], ["description", "Used For Allergy "], ["company", "Covac"], ["batch_number", "C#227"], ["manufacturing_date", "12/09/2018"], ["expiry_date", "17/09/2020"], ["user_id", 1]]

	def edit
		@medicine = Medicine.find(params[:id])
---
SELECT  "medicines".* FROM "medicines" WHERE "medicines"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def search
	  if params[:search].blank?
	    redirect_to(root_path, alert: "Empty field!") and return
	  else
	    @medicine = params[:search]
	    @results = Medicine.all.where("title LIKE :search", search: @medicine)
---
SELECT "medicines".* FROM "medicines" WHERE (lower(name) LIKE 'serta')

	def update
		@medicine = Medicine.find(params[:id])
		if @medicine.update(medicine_params)
---
SELECT  "medicines".* FROM "medicines" WHERE "medicines"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "medicines" SET "description" = ? WHERE "medicines"."id" = ?  [["description", "For energy and workforce and power"], ["id", 2]]

	def show
		@medicine = Medicine.find(params[:id])
---
SELECT  "medicines".* FROM "medicines" WHERE "medicines"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

	def destroy
		@medicine = Medicine.find(params[:id])
		@medicine.destroy
---
SELECT  "medicines".* FROM "medicines" WHERE "medicines"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "medicines" WHERE "medicines"."id" = ?  [["id", 5]]