my_tasks/ncc/app/views/medicines/show.html.erb

						</li>
						<li><small> <%= pluralize(@medicine.user.medicines.count, "medicine") if @medicine.user.medicines %> </small></li>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "medicines" WHERE "medicines"."user_id" = ?  [["user_id", 1]]